
#1 დავალება
print("გამარჯობა! თქვენ იმყოფებით მაღაზია SpaceX-ში.")
print("ჩვენი პროდუქტებია:")
print("რაკეტა - 15000$")
print("ხომალდი - 25000$")
print("ჩაფხუტი - 5000$")

ჯამური_ფასი = 0

while True:
    არჩევანი = input("რომელი ნივთი გსურთ? (თუ დაასრულეთ, ჩაწერეთ 'დასასრული'): ")

    if არჩევანი == "დასასრული":
        break
    elif არჩევანი == "რაკეტა":
        ჯამური_ფასი += 15000
        print("რაკეტა დამატებულია კალათაში!")
    elif არჩევანი == "ხომალდი":
        ჯამური_ფასი += 25000
        print("ხომალდი დამატებულია კალათაში!")
    elif არჩევანი == "ჩაფხუტი":
        ჯამური_ფასი += 5000
        print("ჩაფხუტი დამატებულია კალათაში!")
    else:
        print("მსგავსი პროდუქტი არ გვაქვს.")

if ჯამური_ფასი > 0:
    print("ჯამური თანხაა:", ჯამური_ფასი, "$")

    თანხმობა = input("დავადასტუროთ შენაძენი? (კი / არა): ")

    if თანხმობა == "კი":
        print("გილოცავთ შენაძენს")
    elif თანხმობა == "არა":
        print("თქვენი შენაძენი უარყოფილია")

else:
    print("თქვენი კალათა ცარიელია")

#2 დავალება
print("FOR ციკლის ვარიანტი")

for რიცხვი in range(1, 21):
    if რიცხვი % 2 == 0:
        print(რიცხვი, "- ლუწია")
    else:
        print(რიცხვი, "- კენტია")


print("WHILE ციკლის ვარიანტი")

რიცხვი = 1

while რიცხვი <= 20:
    if რიცხვი % 2 == 0:
        print(რიცხვი, "- ლუწია")
    else:
        print(რიცხვი, "- კენტია")
    რიცხვი += 1

#3 დავალება
students = {
    "Ana": [89, 66, 12, 75, 11],
    "Giorgi": [67, 72, 90, 91, 55],
    "Levant": [49, 36, 88, 98, 34],
    "Veronika": [99, 88, 32, 65, 99],
    "Nika": [77, 81, 41, 73, 99]
}

print("სტუდენტების შედეგები")

for სტუდენტი in students:

    ქულების_სია = students[სტუდენტი]

    ჯამი = 0
    for ქულა in ქულების_სია:
        ჯამი += ქულა
    საშუალო_ქულა = ჯამი / len(ქულების_სია)
    if საშუალო_ქულა >= 90:
        ნიშანი = "A"
    elif საშუალო_ქულა >= 80:
        ნიშანი = "B"
    elif საშუალო_ქულა >= 70:
        ნიშანი = "C"
    elif საშუალო_ქულა >= 60:
        ნიშანი = "D"
    else:
        ნიშანი = "F"

    print(სტუდენტი, "- საშუალო ქულა:", საშუალო_ქულა, "/ ნიშანი:", ნიშანი)

#4 დავალება
print("დაბადების წელის გამომთვლელი")

while True:
    კალკულატორი = input("გთხოვთ, შეიყვანოთ თქვენი ასაკი: ")
    if კალკულატორი.isdigit():
        ასაკი = int(კალკულატორი)
        დაბადების_წელი = 2026 - ასაკი

        print("თქვენი დაბადების წელია", დაბადების_წელი)
        break

    else:
        print("გთხოვთ შეიყვანოთ მხოლოდ რიცხვები.")

#5 დავალება
mylist = range(100)

ინდექსი = 0

print("რიცხვების მე-2 და მე-3 ხარისხები")

while ინდექსი < len(mylist):
    მიმდინარე_რიცხვი = mylist[ინდექსი]

    მეორე_ხარისხი = მიმდინარე_რიცხვი ** 2
    მესამე_ხარისხი = მიმდინარე_რიცხვი ** 3

    print("რიცხვი:", მიმდინარე_რიცხვი, "/ მეორე ხარისხი:", მეორე_ხარისხი, "/ მესამე ხარისხი:", მესამე_ხარისხი)

    ინდექსი += 1

#6 დავალება
print("გამრავლების ტაბულა")

for i in range(1, 11):
    for x in range(1, 11):
        print(i * x, end=" ")

    print()

#7 დავალება
numbers = ["1", "2", "3", "4"]
total = 0

for n in numbers:
    total += int(n)

print("Total:", total)

#შეცდომა იყო ის, რომ numbers-ში ელემენტები არის ბრჭყალებში, რაც ნიშნავს იმას რომ სტრინგია.
#ტოტალ ცვლადიმკი ნულის ტოლია, შესაბამისად ინტენჯერია. გაშვების შემდგომ აგდებს typeerror-ს
#ვიანიდან შეუძლებელია სტრინგ ინტეჯერი მივუმატოთ.
#პრობლემის გადასაწყვეტათ ვიყენებთ კასტინგს total += int(n) , ანუ int() ფუნქციით სტრინგს
#გარვდაქმნით ინტეჯერად, რის შემდგომ შესაძლებელია მათემატიკური მაქინაცია - total

#8 დავალება
data = ["5", 0, "3", True, "", 2, "x", False]
total = 0

for ელემენტი in data:
    if type(ელემენტი) == str:
        if ელემენტი.isdigit():
            total += int(ელემენტი)

    elif type(ელემენტი) == int or type(ელემენტი) == float:
        total += ელემენტი

print("სრული ჯამი არის", total)

#9 დავალება
transactions = {
    "გიო": "100",
    "ნიკა": 50,
    "აკაკი": "30a",
    "ლევანი": 0,
    "ანა": "70",
    "მარი": True
}
total = 0

for value in transactions.values():
    if type(value) == str:
        if value.isdigit():
            total += int(value)
    elif type(value) == bool:
        if value == True:
            total += 1
    elif type(value) == int:
        total += value

print("საბოლოო ჯამი", total)

#10 დავალება
საიდუმლო_რიცხვი = 16
მცდელობები = 0

print("რიცხვის გამოცნობა")
print("(თამაშის გამოსართავად ჩაწერე exit)")

while True:
    შემოტანილი_მონაცემი = input("ჩაწერე ვარიანტი - ")
    if შემოტანილი_მონაცემი == "exit":
        print("თამაში დასრულდა.")
        break
    if not შემოტანილი_მონაცემი.isdigit():
        print("გთხოვთ შეიყვანოთ მხოლოდ რიცხვები")
        continue

    რიცხვი = int(შემოტანილი_მონაცემი)
    if რიცხვი < 0 or რიცხვი > 51:
        print("რიცხვი სცდება არეალს, დიაპაზონია 0-დან 51-მდე")
        continue

    მცდელობები += 1

    if რიცხვი == საიდუმლო_რიცხვი:
        print(f"გილოცავ, გამოიცანი - {საიდუმლო_რიცხვი}, შენ გქონდა {მცდელობები} მცდელობა")
    elif რიცხვი < საიდუმლო_რიცხვი:
        print("საიდუმლო რიცხვი უფრო დიდია")
    else:
        print("საიდუმლო რიცხვი უფრო პატარაა")
